### Running Sqlite queries inside Jupyter notebooks

We need two packages, `sqlite3` to connect to the database, and `pandas` for the nice dataframes

In [1]:
import sqlite3
import pandas as pd

We connect to the SQLite file that has our data.

The sample file for the *Teach Yourself SQL in 10 Minutes* book is located on the author's website (https://forta.com/books/0135182794/).
Scroll down to the information about Appendix A, then click to download the SQLite files.
When you unzip the download, you will have a database file called "TYSQL.sqlite"

I have placed the SQLite database file in the same folder as this Jupyter notebook, so I don't need to specify a folder path to find the database.

In [2]:
con = sqlite3.connect("TYSQL.sqlite")

We can use the `read_sql_query()` function to run a query and place the results into a Pandas dataframe.

In [3]:
df = pd.read_sql_query("SELECT * from Customers;", con)

Jupyter does nice HTML formatting of dataframes (but it limits the number of rows and columns it will display).

In [4]:
df

,cust_id,cust_name,cust_address,cust_city,cust_state,cust_zip,cust_country,cust_contact,cust_email
0,1000000001,Village Toys,200 Maple Lane,Detroit,MI,44444,USA,John Smith,sales@villagetoys.com
1,1000000002,Kids Place,333 South Lake Drive,Columbus,OH,43333,USA,Michelle Green,None
2,1000000003,Fun4All,1 Sunny Place,Muncie,IN,42222,USA,Jim Jones,jjones@fun4all.com
3,1000000004,Fun4All,829 Riverside Drive,Phoenix,AZ,88888,USA,Denise L. Stephens,dstephens@fun4all.com
4,1000000005,The Toy Store,4545 53rd Street,Chicago,IL,54545,USA,Kim Howard,kim@thetoystore.com
5,1000000006,Toy Land,123 Any Street,New York,NY,11111,USA,None,None